# Module 2 Practice

In [1]:
# creates table at the end
import pandas as pd 
# Going to be used to fetch the data from the internet
import requests
# Going to used to parse through all the data which leads to creating a pandas data frame
from bs4 import BeautifulSoup

In [5]:
# Get the website every time we call the variable 'response'
response = requests.get('https://btech-data-analytics.github.io/bridgerland-technical-college/employees_3.html').text

In [6]:
# initialize beautifulsoup
soup = BeautifulSoup(response, 'html.parser')

In [14]:
# This code looks for a table, then finds all table row tags where the class is employee, then selects the first employee and finds the first table data for that employee. The .text then removes the td tags so we just get the string.
soup.find('table').find_all('tr', class_='employee')[0].find_all('td')[1].text

'John Doe'

In [21]:
# Empty lists where we will store our data into
id = []
name = []
age = []
# Use a loop to find every employee append their data to our empty lists
for employee in soup.find('table').find_all('tr', class_='employee'):
    id.append(employee.find_all('td')[0].text)
    name.append(employee.find_all('td')[1].text)
    age.append(employee.find_all('td')[2].text)

In [20]:
name

['John Doe',
 'Jane Smith',
 'Robert Johnson',
 'Mary Johnson',
 'Michael Brown',
 'Susan Davis',
 'David Wilson',
 'Linda Miller']

In [22]:
id

['101', '102', '103', '104', '105', '106', '107', '108']

In [23]:
age

['28', '32', '24', '29', '35', '27', '31', '33']

In [25]:
df = pd.DataFrame({
    'id': id,
    'name': name,
    'age': age
})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      object
 1   name    8 non-null      object
 2   age     8 non-null      object
dtypes: object(3)
memory usage: 324.0+ bytes

In [26]:
df.head()

    id            name age
0  101        John Doe  28
1  102      Jane Smith  32
2  103  Robert Johnson  24
3  104    Mary Johnson  29
4  105   Michael Brown  35

In [31]:
# Question 1- Average age of employees
df['age'] = df['age'].astype(int)
df['age'].mean()

np.float64(29.875)

In [32]:
# Question 2- Standard deviation of employees
df['age'].std()

np.float64(3.563204817496262)